# CannotDuplicateDesignOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotDuplicateDesignOption Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't duplicate Design Option.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDuplicateDesignOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDuplicateDesignOption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDuplicateDesignOption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace